Revit 2027 API
HVACLoadType.LightingLoadDensity Property
 The lighting load density.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double LightingLoadDensity { get; set; }
Public Property LightingLoadDensity As Double
	Get
	Set
public:
property double LightingLoadDensity {
	double get ();
	void set (double value);
}
member LightingLoadDensity : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The value should be between [0.0,500000.0].
See Also
Reference
HVACLoadType Class
Autodesk.Revit.DB.Analysis Namespace